[
    {
      "id": "hunza-valley",
      "name": "Hunza Valley",
      "lat": 36.3167,
      "lng": 74.6500,
      "region": "Gilgit-Baltistan",
      "category": "mountains",
      "shortDescription": "A mountainous valley known for its scenic beauty and cultural heritage.",
      "description": "Hunza Valley is a mountainous valley in the Gilgit-Baltistan region of Pakistan. The valley provides a spectacular view of Rakaposhi, Ultar Sar, and Bojahagur Duanasir II. The region is surrounded by several high peaks including Rakaposhi, Ultar, Bojahagur, Diran, etc. Hunza is also home to ancient monuments, including the UNESCO World Heritage-listed Baltit Fort.",
      "images": [
        "./images/destinations/hunza/hunza-valley-1.jpg",
        "./images/destinations/hunza/hunza-valley-2.jpg",
        "./images/destinations/hunza/baltit-fort.jpg",
        "./images/destinations/hunza/attabad-lake.jpg"
      ],
      "thumbnail": "./images/destinations/hunza/thumbnail.jpg",
      "travelTips": [
        "Best time to visit: April to October",
        "Accommodation: Hotels and guesthouses are available in Karimabad",
        "Transportation: Accessible by road from Gilgit (2-3 hours)",
        "Don't miss: Baltit Fort, Attabad Lake, and Eagle's Nest viewpoint"
      ]
    },
    {
      "id": "skardu",
      "name": "Skardu",
      "lat": 35.2955,
      "lng": 75.6295,
      "region": "Gilgit-Baltistan",
      "category": "mountains",
      "shortDescription": "Gateway to the mighty Karakoram Range and home to stunning landscapes.",
      "description": "Skardu is a city located in Gilgit-Baltistan region of Pakistan, serving as the gateway to the mighty Karakoram Range. The city is situated at the confluence of the Indus and Shigar rivers at an elevation of nearly 2,500 meters. The region is known for its stunning high-altitude lakes, vast deserts, plateaus and mountains, including K2, the world's second highest peak.",
      "images": [
        "./images/destinations/skardu/shangrila-resort.jpg",
        "./images/destinations/skardu/upper-kachura-lake.jpg",
        "./images/destinations/skardu/deosai-plains.jpg",
        "./images/destinations/skardu/sarfaranga-cold-desert.jpg"
      ],
      "thumbnail": "./images/destinations/skardu/thumbnail.jpg",
      "travelTips": [
        "Best time to visit: May to October",
        "Accommodation: Several hotels and resorts, including Shangrila Resort",
        "Transportation: Accessible by air from Islamabad or by road from Gilgit",
        "Don't miss: Upper Kachura Lake, Deosai National Park, and Sarfaranga Cold Desert"
      ]
    },
    {
      "id": "murree",
      "name": "Murree",
      "lat": 33.9085,
      "lng": 73.3945,
      "region": "Punjab",
      "category": "hill-stations",
      "shortDescription": "A popular hill station and summer resort town in the Galyat region.",
      "description": "Murree is a popular hill station and summer resort town located in the Galyat region of Punjab, Pakistan. It is situated along the Islamabad-Murree Highway, about 30 km northeast of Islamabad. The city sits at an elevation of 2,291 meters (7,516 ft) and serves as a popular tourist destination due to its pleasant weather, scenic beauty, and accessibility from the capital.",
      "images": [
        "./images/destinations/murree/mall-road.jpg",
        "./images/destinations/murree/pindi-point.jpg",
        "./images/destinations/murree/patriata-chair-lift.jpg",
        "./images/destinations/murree/murree-hills.jpg"
      ],
      "thumbnail": "./images/destinations/murree/thumbnail.jpg",
      "travelTips": [
        "Best time to visit: All year round; summer (March-August) for pleasant weather, winter (December-February) for snow",
        "Accommodation: Numerous hotels and guesthouses available in all price ranges",
        "Transportation: Easily accessible by road from Islamabad (about 1-2 hours)",
        "Don't miss: Mall Road, Pindi Point, Kashmir Point, and Patriata (New Murree)"
      ]
    },
    {
      "id": "lahore-fort",
      "name": "Lahore Fort",
      "lat": 31.5880,
      "lng": 74.3156,
      "region": "Punjab",
      "category": "historical",
      "shortDescription": "A historic citadel located in the city of Lahore, a UNESCO World Heritage Site.",
      "description": "The Lahore Fort (Shahi Qila) is a citadel in the city of Lahore, Punjab, Pakistan. It is located in the northwestern corner of the Walled City of Lahore. The trapezoidal composition is spread over 20 hectares. The fort contains 21 notable monuments, some of which date to the era of Emperor Akbar. The Lahore Fort is notable for having been almost entirely rebuilt in the 17th century, when the Mughal Empire was at the height of its splendor and opulence.",
      "images": [
        "./images/destinations/lahore/sheesh-mahal.jpg",
        "./images/destinations/lahore/alamgiri-gate.jpg",
        "./images/destinations/lahore/naulakha-pavilion.jpg",
        "./images/destinations/lahore/diwan-e-khas.jpg"
      ],
      "thumbnail": "./images/destinations/lahore/lahore-fort-thumbnail.jpg",
      "travelTips": [
        "Best time to visit: October to March",
        "Entry fee: PKR 500 for foreigners, PKR 20 for locals",
        "Visiting hours: 8:30 AM to 5:30 PM (closed on Mondays)",
        "Don't miss: Sheesh Mahal (Palace of Mirrors), Alamgiri Gate, and Naulakha Pavilion"
      ]
    },
    {
        "id": "swat-valley",
        "name":"Swat Valley",
        "lat":35.2220,
        "lng":72.4258,
        "region": "KPK",
        "category":"cultural",
        "shortDescription": "often referred to as the Switzerland of the East due to its picturesque landscape; the valley is centered around the Swat River and is popular with tourists for its scenic views and historical sites.",
        "description": "Nestled in the breathtaking mountains of northern Pakistan, Swat Valley is a paradise for nature lovers and adventure seekers alike. Known as the Switzerland of the East, it boasts lush green valleys, snow-capped peaks, and crystal-clear rivers. Tourists can explore the historic Buddhist sites of the Gandhara civilization, hike through scenic trails in Malam Jabba and Kalam, or enjoy thrilling activities like skiing and river rafting. The valley’s rich Pashtun culture, vibrant bazaars, and warm hospitality make it a must-visit destination. Whether you're looking for relaxation or adventure, Swat Valley offers an unforgettable experience.",
              "images": [
        "./images/destinations/lahore/sheesh-mahal.jpg",
        "./images/destinations/lahore/alamgiri-gate.jpg",
        "./images/destinations/lahore/naulakha-pavilion.jpg",
        "./images/destinations/lahore/diwan-e-khas.jpg"
      ],
      "thumbnail": "./images/destinations/lahore/lahore-fort-thumbnail.jpg",
      "travelTips": [
        "From Islamabad: Approx. 5-6 hours by road. Best route is via the Swat Motorway.",
        "By Air: The nearest airport is in Saidu Sharif (limited flights).",
        "Rent a 4x4 Jeep for exploring off-road areas like Kumrat, Mahodand, and Kalam Valley.",
        "Must Try: Chapli Kabab, Trout Fish, Dum Pukht, and local dry fruits."
      ]
        
    },
    {
        "id": "deosai-national-park",
        "name":"Deosai National Park",
        "lat":34.58,
        "lng":75.24,
        "region": "Gilgit Baltistan",
        "category":"Natural Wonder",
        "shortDescription": "an alpine plateau of exceptional beauty and ecological value located in the western massif of the Himalayas, east of Nanga Parbat Peak and in close proximity to the Central Karakoram Range",
        "description": "Deosai is a high-altitude alpine plain situated at an average elevation of 4,114 m above sea level. In Balti language, it is called “Ghbiarsa” meaning “summer’s Place” as it is only accessible in the summers. Deosai Plains are considered as the second highest plateau in the world. The Deosai plateau experiences extreme cold, low atmospheric pressure, low oxygen and carbon dioxide levels, aridity, and intense UV radiation. Due to its location facing the monsoon-affected outer Himalayas, it receives more rainfall than the nearby valleys of Baltistan, with annual precipitation ranging from 350 to 550 mm, mostly as winter snow.",

              "images": [
        "./images/destinations/lahore/sheesh-mahal.jpg",
        "./images/destinations/lahore/alamgiri-gate.jpg",
        "./images/destinations/lahore/naulakha-pavilion.jpg",
        "./images/destinations/lahore/diwan-e-khas.jpg"
      ],
      "thumbnail": "./images/destinations/lahore/lahore-fort-thumbnail.jpg",
      "travelTips": [
        " There is little to no mobile network coverage in Deosai, so inform someone about your travel plans before you go.",
        "Do not litter, avoid disturbing wildlife, and respect the pristine environment of this beautiful national park.",
        "Deosai is at a high altitude (over 4,000m), so move slowly and stay hydrated to avoid altitude sickness.",
        "Pack warm clothes, even in summer, as temperatures drop drastically at night. A rain jacket and sturdy hiking shoes are also recommended."
      ]
    }
  ]
